In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from sklearn.linear_model import LinearRegression
from sklearn import metrics
import matplotlib.pyplot as plt
import matplotlib.style
%matplotlib inline

In [2]:
df = pd.read_csv('ThreeCars.csv')

In [3]:
df.head()

   Unnamed: 0  Price  Age  Mileage  Porsche  Jaguar  BMW
0           1   69.4    3     21.5        1       0    0
1           2   56.9    3     43.0        1       0    0
2           3   49.9    2     19.9        1       0    0
3           4   47.4    4     36.0        1       0    0
4           5   42.9    4     44.0        1       0    0

In [4]:
df.shape

(90, 7)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90 entries, 0 to 89
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  90 non-null     int64
 1   Price       90 non-null     float64
 2   Age         90 non-null     int64
 3   Mileage     90 non-null     float64
 4   Porsche     90 non-null     int64
 5   Jaguar      90 non-null     int64
 6   BMW         90 non-null     int64
dtypes: float64(2), int64(5)
memory usage: 5.0 KB

In [6]:
df.describe

<bound method NDFrame.describe of     Unnamed: 0  Price  Age  Mileage  Porsche  Jaguar  BMW
0            1   69.4    3     21.5        1       0    0
1            2   56.9    3     43.0        1       0    0
2            3   49.9    2     19.9        1       0    0
3            4   47.4    4     36.0        1       0    0
4            5   42.9    4     44.0        1       0    0
..         ...    ...  ...      ...      ...     ...  ...
85          86   26.9    6     68.1        0       0    1
86          87   30.0    6     46.8        0       0    1
87          88   36.0    5     46.8        0       0    1
88          89   38.0    4     36.1        0       0    1
89          90   13.8    7     59.0        0       0    1

[90 rows x 7 columns]>

In [7]:
# Copy all the predictor variables into X dataframe
X = df.drop(['Price','Unnamed: 0'], axis=1)

# Copy target into the y dataframe. 
y = df[['Price']]

In [8]:
X.head()

   Age  Mileage  Porsche  Jaguar  BMW
0    3     21.5        1       0    0
1    3     43.0        1       0    0
2    2     19.9        1       0    0
3    4     36.0        1       0    0
4    4     44.0        1       0    0

In [9]:
y.head()

   Price
0   69.4
1   56.9
2   49.9
3   47.4
4   42.9

In [10]:
regression_model = LinearRegression()
regression_model.fit(X,y)

LinearRegression()

In [17]:
for idx, col_name in enumerate(X.columns):
    print("The coefficient for {} is {}".format(col_name, regression_model.coef_[0][idx]))

The coefficient for Age is -0.7635258235387864
The coefficient for Mileage is -0.46233309541154793
The coefficient for Porsche is 10.394965519897942
The coefficient for Jaguar is -8.650050907763925
The coefficient for BMW is -1.744914612133979

In [14]:
# R square on testing data

regression_model.score(X, y)

0.7805691333032706

In [15]:
intercept = regression_model.intercept_[0]

print("The intercept for our model is {}".format(intercept))

The intercept for our model is 60.9981950669325

In [18]:
print(regression_model.coef_[0][0] * 3 + regression_model.coef_[0][1] * 43 + 1 * regression_model.coef_[0][2] + intercept)

49.22226001351753